senseless-eye-candy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Customizations That Serve No Other Purpose Than to Make Me Happy</title>
<!-- 2015-02-04 Wed 10:40 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Toby Tripp" />
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.2/css/bootstrap.min.css">
<link rel="stylesheet" href="css/htmlize.css">
<link rel="stylesheet" href="css/config.css">
</head>
<body>
<div id="preamble" class="status">
<p><a accesskey="H" href="index.html">HOME</a></p>
</div>
<div id="content">
<h1 class="title">Customizations That Serve No Other Purpose Than to Make Me Happy</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Senseless Eye-Candy</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Frame Opacity</h3>
<div class="outline-text-3" id="text-1-1">
<p>
I'm not entirely sure why, but I like to be able to see <i>through</i>
my editor window.  Sometimes I can read documentation through
there, but I have no real excuse other than I think it looks cool.
</p>

<p>
First, a function that adjusts the frame opacity:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">opacity-modify</span> <span style="color: #b58900;">(</span><span style="color: #b58900;">&amp;optional</span> dec<span style="color: #b58900;">)</span>
  <span style="color: #2aa198; font-style: italic;">"Modify the transparency of the emacs frame; if DEC is t,</span>
<span style="color: #2aa198; font-style: italic;"> decrease the transparency, otherwise increase it in 5%-steps"</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let*</span> <span style="color: #268bd2;">(</span><span style="color: #dc322f;">(</span>alpha-or-nil <span style="color: #cb4b16;">(</span>frame-parameter nil 'alpha<span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span> <span style="color: #586e75;">; </span><span style="color: #586e75;">nil before setting</span>
         <span style="color: #dc322f;">(</span>oldalpha <span style="color: #cb4b16;">(</span><span style="color: #859900; font-weight: bold;">if</span> alpha-or-nil alpha-or-nil 100<span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span>
         <span style="color: #dc322f;">(</span>newalpha <span style="color: #cb4b16;">(</span><span style="color: #859900; font-weight: bold;">if</span> dec <span style="color: #268bd2;">(</span>- oldalpha 5<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>+ oldalpha 5<span style="color: #268bd2;">)</span><span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">when</span> <span style="color: #dc322f;">(</span>and <span style="color: #cb4b16;">(</span>&gt;= newalpha frame-alpha-lower-limit<span style="color: #cb4b16;">)</span> <span style="color: #cb4b16;">(</span>&lt;= newalpha 100<span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span>
      <span style="color: #dc322f;">(</span>modify-frame-parameters nil <span style="color: #cb4b16;">(</span>list <span style="color: #268bd2;">(</span>cons 'alpha newalpha<span style="color: #268bd2;">)</span><span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>

<p>
Then, some interactive functions to call it:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">toby/increase-frame-opacity</span> <span style="color: #b58900;">()</span>
  <span style="color: #b58900;">(</span>interactive<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>opacity-modify<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">toby/decrease-frame-opacity</span> <span style="color: #b58900;">()</span>
  <span style="color: #b58900;">(</span>interactive<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>opacity-modify t<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">toby/reset-frame-opacity</span> <span style="color: #b58900;">()</span>
  <span style="color: #b58900;">(</span>interactive<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>modify-frame-parameters nil `<span style="color: #268bd2;">(</span><span style="color: #dc322f;">(</span>alpha . 100<span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>

<p>
Finally, some keybindings to invoke it all:
</p>
<ul class="org-ul">
<li>C-c C-8 will increase opacity (== decrease transparency)
</li>
<li>C-c C-9 will decrease opacity (== increase transparency
</li>
<li>C-c C-0 will returns the state to normal
</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>global-set-key <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"C-c C-8"</span><span style="color: #b58900;">)</span> 'toby/increase-frame-opacity<span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span>global-set-key <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"C-c C-9"</span><span style="color: #b58900;">)</span> 'toby/decrease-frame-opacity<span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span>global-set-key <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"C-c C-0"</span><span style="color: #b58900;">)</span> 'toby/reset-frame-opacity<span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">WHITESPACE!</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Show me those pesky white-space errors so I might crush them!
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>setq whitespace-display-mappings
      '<span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>space-mark 32   <span style="color: #dc322f;">[</span>183<span style="color: #dc322f;">]</span>  <span style="color: #dc322f;">[</span>46<span style="color: #dc322f;">]</span><span style="color: #268bd2;">)</span>   <span style="color: #586e75;">; </span><span style="color: #586e75;">normal space, &#183;</span>
        <span style="color: #268bd2;">(</span>space-mark 160  <span style="color: #dc322f;">[</span>164<span style="color: #dc322f;">]</span>  <span style="color: #dc322f;">[</span>95<span style="color: #dc322f;">]</span><span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span>space-mark 2208 <span style="color: #dc322f;">[</span>2212<span style="color: #dc322f;">]</span> <span style="color: #dc322f;">[</span>95<span style="color: #dc322f;">]</span><span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span>space-mark 2336 <span style="color: #dc322f;">[</span>2340<span style="color: #dc322f;">]</span> <span style="color: #dc322f;">[</span>95<span style="color: #dc322f;">]</span><span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span>space-mark 3616 <span style="color: #dc322f;">[</span>3620<span style="color: #dc322f;">]</span> <span style="color: #dc322f;">[</span>95<span style="color: #dc322f;">]</span><span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span>space-mark 3872 <span style="color: #dc322f;">[</span>3876<span style="color: #dc322f;">]</span> <span style="color: #dc322f;">[</span>95<span style="color: #dc322f;">]</span><span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span>newline-mark 10 <span style="color: #dc322f;">[</span>182 10<span style="color: #dc322f;">]</span><span style="color: #268bd2;">)</span>      <span style="color: #586e75;">; </span><span style="color: #586e75;">newlne, &#182;</span>
        <span style="color: #268bd2;">(</span>tab-mark 9 <span style="color: #dc322f;">[</span>9655 9<span style="color: #dc322f;">]</span> <span style="color: #dc322f;">[</span>92 9<span style="color: #dc322f;">]</span><span style="color: #268bd2;">)</span>    <span style="color: #586e75;">; </span><span style="color: #586e75;">tab, &#9655;</span>
        <span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span>setq whitespace-line-column 78<span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span>setq whitespace-style  '<span style="color: #b58900;">(</span>face lines-tail<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Word-Wrapping</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Via: <a href="http://ergoemacs.org/emacs/emacs23_features.html">http://ergoemacs.org/emacs/emacs23_features.html</a>
</p>

<p>
Visual line mode causes lines to be wrapped at word boundaries
instead of in the midst of things.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>global-visual-line-mode 1<span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Theme</h3>
<div class="outline-text-3" id="text-1-4">
<p>
I have one.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>load-theme 'toby<span style="color: #f5deb3;">)</span>
<span style="color: #586e75;">;; </span><span style="color: #586e75;">Make sure terminals pick up the theme settings:</span>
<span style="color: #f5deb3;">(</span>setq term-default-fg-color <span style="color: #b58900;">(</span>face-foreground 'default<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span>setq term-default-bg-color <span style="color: #b58900;">(</span>face-background 'default<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Twitter</h2>
<div class="outline-text-2" id="text-2">
<p>
Talk about senseless…
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>require-package 'twittering-mode<span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span>autoload 'twit <span style="color: #2aa198;">"twittering-mode"</span> <span style="color: #2aa198; font-style: italic;">"Twitter stream in Emacs"</span><span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span>setq twittering-username <span style="color: #2aa198;">"tobytripp"</span><span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span>setq twittering-icon-mode t<span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span>global-set-key <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"C-c t"</span><span style="color: #b58900;">)</span> 'twittering-update-status-interactive<span style="color: #f5deb3;">)</span>
</pre>
</div>

<p>
Make its window sticky:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>toby/defhook twittering-mode-hook
  <span style="color: #b58900;">(</span>set-window-dedicated-p <span style="color: #268bd2;">(</span>selected-window<span style="color: #268bd2;">)</span> 1<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Toby Tripp</p>
<p class="date">Created: 2015-02-04 Wed 10:40</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
